# Pandas

## Pandas Series
- Pandas serileri kolon(değişken) ismi almayan ve indexlenen veriler barındırır.
- Pandas seriler tek boyutludur

### Pandas Seri Oluşturma Yöntemleri

In [8]:
import numpy as np
import pandas as pd

In [ ]:
seri1 = pd.Series([10,20,30,40])  
seri1

In [19]:
seri2 = pd.Series(["Ahmet","Mehmet",3,4.6, None, " "])  # farkli veri tiplrerini barindirabilir. 
seri2

0     Ahmet
1    Mehmet
2         3
3       4.6
4      None
5
dtype: object

In [ ]:
seri3 = pd.Series([1,5,0.9,34], index = (1,3,5,7))    
seri3

In [ ]:
seri4 = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))    # str olarakda index belirleyebiliriz
seri4

In [ ]:
# uygulama
#bir liste ,index ler büyük harf 
liste = [1,3,4,7,9,90]
seri = pd.Series(liste , index = [3,5,6,6,6,6])
seri

In [1]:
sozluk = { "ahmet" : 1000, "mehmet" : 2500, "ayse" : 4500}    #sozluk uzerinden index atayacagiz.
sozluk

{'ahmet': 1000, 'mehmet': 2500, 'ayse': 4500}

In [3]:
seri5 = pd.Series(sozluk)  #sozlugu seriye cevirdik
seri5

ahmet     1000
mehmet    2500
ayse      4500
dtype: int64

In [4]:
np = np.array([1,2,3,566,88])     # array ile seri olusturduk
np

array([  1,   2,   3, 566,  88])

In [5]:
seri6 = pd.Series(np)    #arrayi pandas serisine cevirdik
seri6

0      1
1      2
2      3
3    566
4     88
dtype: int32

In [12]:
# uygulama
# numpy vektör random 20 gözlemli,pandas series 
vektor = np.random.randint(0,100,20)
pd.Series(vektor)

0     87
1      7
2      4
3     23
4     15
5     23
6     51
7     12
8     75
9     57
10    68
11    24
12    20
13    81
14    28
15    21
16    63
17    94
18    40
19    85
dtype: int32

#### type, data type, index, shape sorgulama

In [13]:
seri6

0      1
1      2
2      3
3    566
4     88
dtype: int32

In [14]:
type(seri6)

pandas.core.series.Series

In [16]:
seri5

ahmet     1000
mehmet    2500
ayse      4500
dtype: int64

In [15]:
seri5.axes    #index hakkinda bilgi  verir

[Index(['ahmet', 'mehmet', 'ayse'], dtype='object')]

In [17]:
seri6.index #index hakkinda bilgi  verir axes ile ayni isi yapar

RangeIndex(start=0, stop=5, step=1)

In [20]:
seri2

0     Ahmet
1    Mehmet
2         3
3       4.6
4      None
5
dtype: object

In [21]:
seri2.dtype   #veri tipi hakkinda bilgi verir

dtype('O')

#### serideki verilere erişim

In [22]:
seri = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))    # str olarakda index belirleyebiliriz
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [24]:
seri["c"],seri[3]   #index ismi ile veya sıra numarası ile veriye erişim

(0.9, 34.0)

In [25]:
seri[["a","c"]]  # a ve c indisli verilere ulaşır. İç içe köşeli parantezlere dikkat.

a    1.0
c    0.9
dtype: float64

In [27]:
seri["a":"c"]  # belli bir aralıkdaki verilere erişim

a    1.0
b    5.0
c    0.9
dtype: float64

In [28]:
seri[0:3]

a    1.0
b    5.0
c    0.9
dtype: float64

In [29]:
seri[(seri > 1) & (seri < 10)] # 1'den büyük 10'dan küçük verilere erişim

b    5.0
dtype: float64

#### index, keys, values, items ile verilere erişim

In [30]:
seri = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))    # str olarakda index belirleyebiliriz
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [31]:
print(seri.index, seri.keys, seri.values,seri.items, sep='\n\n*************************\n')

Index(['a', 'b', 'c', 'd'], dtype='object')

*************************
<bound method Series.keys of a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64>

*************************
[ 1.   5.   0.9 34. ]

*************************
<bound method Series.items of a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64>

#### sorgulama yapma ve değer atama

In [32]:
seri = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))    # str olarakda index belirleyebiliriz
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [33]:
'a' in seri,'e' in seri

(True, False)

In [34]:
seri['b']=500
seri

a      1.0
b    500.0
c      0.9
d     34.0
dtype: float64

## Concat ile birlestirme

In [35]:
seri = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))    
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [39]:
seri = pd.concat([seri, seri, seri])    #serileri birlestirir. concat ile birlestirme

In [37]:
seri.append(seri)    #append ile birlestirme de yapilabilir

a     1.0
b     5.0
c     0.9
d    34.0
a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [40]:
seri

a     1.0
b     5.0
c     0.9
d    34.0
a     1.0
b     5.0
c     0.9
d    34.0
a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

uygulama
liste1, liste2
1. seriye dönüştür
2. birleştir

In [42]:
liste1=[i for i in range(10)]
liste2=[j for j in range(20,30)]
seri10 = pd.Series(liste1)
seri11 = pd.Series(liste2)
seri_con=pd.concat([seri10,seri11])
seri_con

0     0
1     1
2     2
3     3
4     4
5     5
6     6
7     7
8     8
9     9
0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
dtype: int64

## loc ve iloc
Yukarıda anlatılan veriye erişim yöntemleri ile bazı sorunlar yaşandığınan loc ve iloc metoduna ihtiyaç duyulmaktadır.

In [43]:
seri = pd.Series(['a','b','c','d','e'], index = (1,2,3,4,5))    
seri

1    a
2    b
3    c
4    d
5    e
dtype: object

In [44]:
seri[0] # sıfır indisli veri olamdığından hata olacaktır

KeyError: 0

In [45]:
seri[1]

'a'

In [46]:
# fakat kodu aşağıdaki gibi yazarsak bu defa da 1 indisli veri elde edilemeyecektir
seri[1:3]

2    b
3    c
dtype: object

In [47]:
seri[0:3]

1    a
2    b
3    c
dtype: object

Bu nedenle loc ve iloc metodlarına ihtiyaç duyulmaktadır

In [48]:
seri = pd.Series([1,5,0.9,34], index = ('a','b','c','d'))   
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [49]:
seri.loc['a':'c'] # loc label based indexing, index ismi ile veriye erişim

a    1.0
b    5.0
c    0.9
dtype: float64

In [50]:
seri.iloc[0:3] # iloc positional indexing, sıra numarasına göre veriye erişim

a    1.0
b    5.0
c    0.9
dtype: float64

# Pandas DataFrame 
Hem indekslerin hemde kolon(değişken) isimlerinin olduğu, birden çok değişkeni ve farklı veri tiplerini barındırabilen veri tipleridir.

### DataFrame Oluşturma Yöntemleri

In [51]:
import numpy as np
import pandas as pd

In [52]:
# Listeyi DataFrame dönüştürme
liste = [1,4,577,343]

In [55]:
df1 = pd.DataFrame(liste, columns = ['degisken_ismi'] )   # liste verisini kolon ismi ile dönüştürür
df1

   degisken_ismi
0              1
1              4
2            577
3            343

In [ ]:
# Pandas Serileri dönüştürme

In [56]:
bir = pd.Series([1,2,'a',4])
iki = pd.Series([1,'c',3,4.1])

In [57]:
pd.DataFrame({'deg1':bir,'deg2':iki})

  deg1 deg2
0    1    1
1    2    c
2    a    3
3    4  4.1

### Not:
Sözlük yapısında oluşturulan df'lerde sölüğün key'leri değişken ismi olacaktır

In [58]:
# Numpy df dönüştürme

In [64]:
s1 =np.random.randint(10, size = 5) 
s2 =np.random.randint(10, size = 5)
s3 =np.random.randint(10, size = 5)

In [65]:
pd.DataFrame({'var1':s1, 'var2':s2, 'var3':s3})

   var1  var2  var3
0     7     2     4
1     0     7     6
2     9     4     0
3     5     3     3
4     9     0     4

In [ ]:
# 3X3 matris şeklindeki numpy veriyi df'ye dönüştürme

In [66]:
array = np.arange(1,10).reshape((3,3))   #iki boyutlu numpy array olusturduk
array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [67]:
pd.DataFrame(array, columns = ['col1','col2','col3'])  # değişken isimlerini tanımlama şekline dikkat

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
#Sözlükleri dönüştürme

In [69]:
sozluk = {"Amsterdam" : {"Sicaklik":12 ,
                    "Nem": 70,
                    "Ruzgar": 19},
          
           "Rotterdam" : {"Sicaklik": 15,
                    "Nem": 65,
                    "Ruzgar": 22},
                    
          "Schinnen": {"Sicaklik": 18,
                    "Nem": 88,
                    "Ruzgar": 24}}

In [70]:
pd.DataFrame(sozluk)

          Amsterdam  Rotterdam  Schinnen
Sicaklik         12         15        18
Nem              70         65        88
Ruzgar           19         22        24

 ## Uygulama
 Aşağıda verilen üç pandas series'i DataFrame çeviriniz

In [71]:
isimler = pd.Series(["Tarik","Sinan","Fatma","Zeynep"])    
sehirler = pd.Series(["Amsterdam","Rotterdam","Eindhoven","Dronten"])   
ulke = pd.Series(["Hollanda"])

In [72]:
df2 = pd.DataFrame({"isimler": isimler, "sehirler": sehirler, "ulke": ulke})
df2

  isimler   sehirler      ulke
0   Tarik  Amsterdam  Hollanda
1   Sinan  Rotterdam       NaN
2   Fatma  Eindhoven       NaN
3  Zeynep    Dronten       NaN

In [ ]:
pd.DataFrame({'Isim': isimler,
             'Sehir': sehirler,
             'Ulke' : ulke})

## Uygulama
Numpy ile random 1 ile 100 arasında 20'şer intger sayı içeren üç seri oluşturunuz. Ve bu serileri DataFrame çeviriniz.

In [73]:
a1 = np.random.randint(1,100,size=20)
a2 = np.random.randint(1,100,size=20)
a3 = np.random.randint(1,100,size=20)
df3 = pd.DataFrame({'a1':a1,'a2':a2,'a3':a3})
df3

    a1  a2  a3
0   44  53  88
1   22  33  82
2   35  14  95
3   69  15  97
4   12  67  58
5   96  48  47
6   19  21  52
7   12  21  11
8   36  92  33
9   92  28  62
10   1  34  81
11  40  25  95
12  60   7  11
13  35  31  95
14  24  37   3
15  94  42  56
16  54  19  38
17  42  24  13
18  50  64  97
19  58  29  38

In [ ]:
seri1 = np.random.randint(1,100,20)
seri2 = np.random.randint(1,100,20)
seri3 = np.random.randint(1,100,20)

In [ ]:
pd.DataFrame({'var1':seri1,'var2':seri2,'var3':seri3})

## Değişken İsim Belirleme ve Değiştirme

In [74]:
seri1 = np.random.randint(1,100,10)
seri2 = np.random.randint(1,100,10)
seri3 = np.random.randint(1,100,10)

In [75]:
df = pd.DataFrame({'var1':seri1,'var2':seri2,'var3':seri3})
df

   var1  var2  var3
0    35    99    81
1    27    96    46
2    62    12    97
3     6    25    14
4    92    35    88
5    13    62     7
6    75    19    29
7    62    29    26
8    94    56    45
9    99    29    49

In [ ]:
# Değişken isimlerini değiştirelim

In [76]:
df.columns = ['deg1','deg2','deg3']
df

   deg1  deg2  deg3
0    35    99    81
1    27    96    46
2    62    12    97
3     6    25    14
4    92    35    88
5    13    62     7
6    75    19    29
7    62    29    26
8    94    56    45
9    99    29    49

In [ ]:
# Benzer yöntemle indexleride değiştirebiliriz.

In [77]:
df.index = [1,23,4,4,55,6,6,6,77,8]
df

    deg1  deg2  deg3
1     35    99    81
23    27    96    46
4     62    12    97
4      6    25    14
55    92    35    88
6     13    62     7
6     75    19    29
6     62    29    26
77    94    56    45
8     99    29    49

In [78]:
array = np.arange(1,10).reshape((3,3))

In [79]:
df = pd.DataFrame(array, columns = ['A','B','C'], index = ['a', 'b', 'c'])
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

## Uygulama
radom integer sayılardan 3X4 bir numpy matris oluşturun. Bu matrisi df'ye çeirin. Değişken isimleri Var1,Var2,Var3 olsun, indexlerde harfler olsun.

In [80]:
matris2 = np.random.randint(0,12,(3,4))
df5 = pd.DataFrame(matris2,columns=['Var1','Var2','Var3','Var4'],index=['a','b','c'])
df5

   Var1  Var2  Var3  Var4
a     6     8     2    11
b    10    11    11     8
c     0     1    10     1

In [ ]:
veri = np.random.randint(10, size = (4,3))
veri

In [ ]:
pd.DataFrame(veri, columns = ['Var1', 'Var2', 'Var3'], index = ['a', 'b', 'c', 'd'])

## type,index, shape, size sorgusu

In [81]:
df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
df.index    # index hakkinda bize bilgiler verir

Index(['a', 'b', 'c'], dtype='object')

In [84]:
df.shape  #satir ve sutun sayilari hakkinda bilgi verir

(3, 3)

In [85]:
df.size   # icinde kac eleman oldugunu soyler

9

# Satır ve Sütünlara Erişmek

In [86]:
s1 = np.random.randint(10, size = 5)   
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"kolon1": s1, "kolon2": s2,"kolon3": s3})  
df

   kolon1  kolon2  kolon3
0       4       3       5
1       8       0       6
2       9       8       1
3       6       7       2
4       4       7       7

In [87]:
df[:2]    # ilk iki satıra ulaşmak için

   kolon1  kolon2  kolon3
0       4       3       5
1       8       0       6

In [88]:
df[2:4]   # 2. indisden 4. indise kadar elemanlara erişmek

   kolon1  kolon2  kolon3
2       9       8       1
3       6       7       2

In [89]:
df.kolon1 # kolon1 değişknine erişmek

0    4
1    8
2    9
3    6
4    4
Name: kolon1, dtype: int32

In [90]:
df['kolon1'] # bu yöntemle de kolon1 değişkenine erişebiliriz. Bu yöntem daha çok kulanılır

0    4
1    8
2    9
3    6
4    4
Name: kolon1, dtype: int32

In [91]:
df[['kolon1','kolon2']] # iki kolona erişmek

   kolon1  kolon2
0       4       3
1       8       0
2       9       8
3       6       7
4       4       7

In [92]:
deg = ['kolon1','kolon2']  # aynı sonucu verir
df[deg]

   kolon1  kolon2
0       4       3
1       8       0
2       9       8
3       6       7
4       4       7

## loc, iloc - Gözlem ve Değişkenlere Birlikte Erişmek

In [93]:
s1 = np.random.randint(10, size = 5)     # 0 dan 10 kadar random 5 adet sayi uretecek
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})     #uretilen sayilari DF ye cevirdik
df

   var1  var2  var3
0     3     7     7
1     0     4     3
2     8     7     4
3     3     3     3
4     0     5     4

In [95]:
df[0:3]

   var1  var2  var3
0     3     7     7
1     0     4     3
2     8     7     4

In [94]:
df.loc[0:3]    # 0 dan 3.indexe kadar  3 dahil

   var1  var2  var3
0     3     7     7
1     0     4     3
2     8     7     4
3     3     3     3

In [96]:
df.iloc[0:3]    #0 dan 3.indexe kadar  3 dahil degil

   var1  var2  var3
0     3     7     7
1     0     4     3
2     8     7     4

In [100]:
df.iloc[0,0]

3

In [99]:
df.loc[0,'var1']    #0.satir, 0.sutun

3

In [101]:
df.iloc[:3,:2]    # en bastan 3.satira, en bastan 2.indexli ssutuna kadar

   var1  var2
0     3     7
1     0     4
2     8     7

### Not:
iloc'un bir özelliği olarak sütünlarıda indis numarası ile çağırabildiğimize dikkat

In [102]:
df.iloc[2:6,1:3]     # 2.indexli satirdan 3.satira, 1.indexli sutundan 2.indexli sutuna kadar

   var2  var3
2     7     4
3     3     3
4     5     4

In [103]:
df.loc[0:3, 'var3']      # en bastan 3.satira kadar, sutunu "var3" olanlari sececek

0    7
1    3
2    4
3    3
Name: var3, dtype: int32

### Not:
loc ile cağrılacak değişken ismi ile çağrıldığına dikkat

In [104]:
df.index = ["a","b","c","d","e"]    #indexleri degistirdik

In [105]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

In [106]:
df.loc["c":"d", "var2":"var3"]    # c indexinden : d indexine kadar, var2 sutunundan : var3 sutununa kadar olanlar

   var2  var3
c     7     4
d     3     3

In [107]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

### Sorgulama Yaparak Verilere Erişme

In [108]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

In [111]:
df.var2

a    7
b    4
c    7
d    3
e    5
Name: var2, dtype: int32

In [112]:
df['var2']

a    7
b    4
c    7
d    3
e    5
Name: var2, dtype: int32

In [110]:
df[df.var3 > 3]['var2']

#verisetindeki var1 sutunundaki degerleri 3 den buyuk olanlari secer ve sadece var2 sutununu gosterir

a    7
c    7
e    5
Name: var2, dtype: int32

In [113]:
df[(df.var1 > 3) & (df.var3 < 5)]  

#var1 de 3 den buyuk ve var3 de 5 den kucuk olanlari secer.

   var1  var2  var3
c     8     7     4

In [117]:
df.loc[df.var1 > 3, ['var2','var1']]   # var1 i 3 den buyuk olan var2 ve var1 i sirasiyla yazdirsin

   var2  var1
c     7     8

In [118]:
df.loc[df.var1 > 3, 'var1':'var3']

   var1  var2  var3
c     8     7     4

## Drop etme, eleman dusurme

In [119]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

In [120]:
df.drop('a', axis = 0)   # a indexini datadan cikartir, ama ana dataya islemez.

   var1  var2  var3
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

In [121]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
c     8     7     4
d     3     3     3
e     0     5     4

In [122]:
df.drop('c', axis = 0, inplace = True) # a indexini dusurur ve inplace = True ile orijinal datadan da siler. kalici yapar.

In [123]:
df

   var1  var2  var3
a     3     7     7
b     0     4     3
d     3     3     3
e     0     5     4

In [124]:
df = df.drop('a', axis = 0)

In [125]:
df

   var1  var2  var3
b     0     4     3
d     3     3     3
e     0     5     4

In [126]:
df.drop('var1', axis = 1, inplace = True) # Var1 sutunu dusurur ve inplace = True ile orijinal datadan da siler. kalici yapar.

In [127]:
df

   var2  var3
b     4     3
d     3     3
e     5     4

### Yeni Kolon ekleme

In [128]:
df

   var2  var3
b     4     3
d     3     3
e     5     4

In [129]:
df['bolme'] = df['var3'] / df['var2']  
df
# var1 ve var2 kolonlarini birbirine boler ve cikan sonucu var4 adli yeni bir kolon olusturur ve dataya bu kolonu ekler

   var2  var3  bolme
b     4     3   0.75
d     3     3   1.00
e     5     4   0.80

In [130]:
df['A']='a'

In [131]:
df

   var2  var3  bolme  A
b     4     3   0.75  a
d     3     3   1.00  a
e     5     4   0.80  a

In [133]:
df.drop('A', axis = 1, inplace = True)

In [134]:
df

   var2  var3  bolme
b     4     3   0.75
d     3     3   1.00
e     5     4   0.80

In [137]:
df['A'] = ['a','b','c']
df

   var2  var3  bolme isimler  A
b     4     3   0.75    ayse  a
d     3     3   1.00   fatma  b
e     5     4   0.80   ahmet  c

In [136]:
df["isimler"] = ["ayse", "fatma", "ahmet"] #isimler kolonu ekledik..
df

   var2  var3  bolme isimler
b     4     3   0.75    ayse
d     3     3   1.00   fatma
e     5     4   0.80   ahmet

## verileri  degistirme

In [139]:
s1 = np.random.randint(10, size = 5)     # 0 dan 10 kadar random 5 adet sayi uretecek
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})     #uretilen sayilari DF ye cevirdik
df

   var1  var2  var3
0     8     1     2
1     4     7     9
2     9     2     7
3     4     8     9
4     1     9     8

In [140]:
df.replace(9,333, inplace=True)
df

   var1  var2  var3
0     8     1     2
1     4     7   333
2   333     2     7
3     4     8   333
4     1   333     8

In [142]:
df.var3.replace(7,"mavi", inplace=True)
df

   var1  var2  var3
0     8     1     2
1     4     7   333
2   333     2  mavi
3     4     8   333
4     1   333     8

In [143]:
df.fillna("veri yok")  # NaN olan verileri baska bir veri ile değiştirme

   var1  var2  var3
0     8     1     2
1     4     7   333
2   333     2  mavi
3     4     8   333
4     1   333     8

## Uygulma
isimler = pd.Series(["Tarik","Sinan","Fatma","Zeynep"])    
sehirler = pd.Series(["Amsterdam","Rotterdam","Eindhoven","Dronten"])   
ulke = pd.Series(["Hollanda"])
serileri ile DataFrame oluşturulacak
verileri isim-şehir şeklinde olan is-se degişkeni oluştur
Nan olan verileri 0 olarak değiştir

In [ ]:
isimler = pd.Series(["Tarik","Sinan","Fatma","Zeynep"])    
sehirler = pd.Series(["Amsterdam","Rotterdam","Eindhoven","Dronten"])   
ulke = pd.Series(["Hollanda"])

In [ ]:
df1 =

# Birleştirme (Join) İşlemleri -concat ve merge

## Concat Join

In [148]:
s1 = np.random.randint(10, size = 5)   
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

df1 = pd.DataFrame({"var1": s1, "var2": s2,"var3": s3})   
df1

   var1  var2  var3
0     4     7     0
1     2     9     9
2     5     5     8
3     4     2     3
4     3     2     0

In [149]:
df2 = df1 + 99  
df2

   var1  var2  var3
0   103   106    99
1   101   108   108
2   104   104   107
3   103   101   102
4   102   101    99

In [150]:
pd.concat([df1,df2], axis = 0)   # olusturulan iki adet df i satir bazinda birlestirdi (altalta), indexler ile beraber

   var1  var2  var3
0     4     7     0
1     2     9     9
2     5     5     8
3     4     2     3
4     3     2     0
0   103   106    99
1   101   108   108
2   104   104   107
3   103   101   102
4   102   101    99

In [151]:
pd.concat([df1,df2], axis = 1)   # olusturulan iki adet df i sutun bazinda birlestirdi,(yanyana) indexler ile beraber

   var1  var2  var3  var1  var2  var3
0     4     7     0   103   106    99
1     2     9     9   101   108   108
2     5     5     8   104   104   107
3     4     2     3   103   101   102
4     3     2     0   102   101    99

In [152]:
pd.concat([df1,df2])        # axis için bir değer girilmez ise default değeri 0 dır.

   var1  var2  var3
0     4     7     0
1     2     9     9
2     5     5     8
3     4     2     3
4     3     2     0
0   103   106    99
1   101   108   108
2   104   104   107
3   103   101   102
4   102   101    99

In [153]:
pd.concat([df1,df2], ignore_index = True)     # ignore_index = True ile indexleri tek bir index yaptik.

   var1  var2  var3
0     4     7     0
1     2     9     9
2     5     5     8
3     4     2     3
4     3     2     0
5   103   106    99
6   101   108   108
7   104   104   107
8   103   101   102
9   102   101    99

In [154]:
df2.columns = ["kolon1","kolon2","kolon3"]

In [155]:
df2

   kolon1  kolon2  kolon3
0     103     106      99
1     101     108     108
2     104     104     107
3     103     101     102
4     102     101      99

In [156]:
df1

   var1  var2  var3
0     4     7     0
1     2     9     9
2     5     5     8
3     4     2     3
4     3     2     0

In [157]:
pd.concat([df1,df2])    # iki df yi altalta birlestirdik fakat bir sutun ismi farkli.

C:\Users\Toshiba\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   kolon1  kolon2  kolon3  var1  var2  var3
0     NaN     NaN     NaN   4.0   7.0   0.0
1     NaN     NaN     NaN   2.0   9.0   9.0
2     NaN     NaN     NaN   5.0   5.0   8.0
3     NaN     NaN     NaN   4.0   2.0   3.0
4     NaN     NaN     NaN   3.0   2.0   0.0
0   103.0   106.0    99.0   NaN   NaN   NaN
1   101.0   108.0   108.0   NaN   NaN   NaN
2   104.0   104.0   107.0   NaN   NaN   NaN
3   103.0   101.0   102.0   NaN   NaN   NaN
4   102.0   101.0    99.0   NaN   NaN   NaN

> Not; Eger birlestirilen iki Df de farkli sutunlar yer aliyorsa bu sutunlarin hepsini ekler. df lerde olmayan sutunlarin degerlerini otomatik olarak NaN ekler.

In [159]:
df2.columns = ["var1","var2","kolon3"]

In [160]:
pd.concat([df1,df2], join = 'inner')  

# birlestirmede farkli sutunlar da varsa o sutunlari almadan, iki df de ortak olan sutunlari alacak

   var1  var2
0     4     7
1     2     9
2     5     5
3     4     2
4     3     2
0   103   106
1   101   108
2   104   104
3   103   101
4   102   101

In [161]:
pd.concat([df1,df2], join_axes = [df1.columns])     

# iki df yi birlestirdi. fakat sadece df1'in sutunlarini baz aldi.

C:\Users\Toshiba\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     4     7   0.0
1     2     9   9.0
2     5     5   8.0
3     4     2   3.0
4     3     2   0.0
0   103   106   NaN
1   101   108   NaN
2   104   104   NaN
3   103   101   NaN
4   102   101   NaN

## Merge Join

> NOT: Merge fonksiyonu otomatik olarak kesisen degerleri kendisi bulur ve uniq olan degerlerin oldugu sutunu baz alarak bir birlestirme islemi yapar. Eger birden fazla kesisen uniq sutun varsa kendisi yeni bir sutun atayarak diger kesisen degerleri bu sutunlara yerlestirir.

In [162]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [163]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],   #sutunlar df1 ile ayni 
                    'ilk_giris': [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [164]:
# df1 ile df1 yi calisanlar sutunu sabit kalacak sekilde sutun bazinda birlestirir,
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [165]:
# birden fazla ortak degiğken varsa calisanlari baz alarak alipda birlestirme islemi yapar, 
df3 = pd.merge(df1, df2, on = 'calisanlar')    
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [168]:
# df1 ile aynı değişkenlere sahip
df4=pd.DataFrame({'calisanlar': ['Veli', 'Ayse', 'Fatma', 'Ali'],   
                    'grup': ["Adana", "istanbul", "edirne", "zonguldak"]})
df4

  calisanlar       grup
0       Veli      Adana
1       Ayse   istanbul
2      Fatma     edirne
3        Ali  zonguldak

In [169]:
pd.merge(df3,df4, on="calisanlar")

  calisanlar       grup_x  ilk_giris     grup_y
0        Ali     Muhasebe       2009  zonguldak
1       Veli  Muhendislik       2014      Adana
2       Ayse  Muhendislik       2010   istanbul
3      Fatma           İK       2019     edirne

## Gruplama İşlemleri

In [170]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [171]:
df.groupby('gruplar')

In [ ]:
# gruplamayı neye göre yapacağın söylemediğimiz için veri döndürmedi

In [173]:
df.groupby('gruplar').mean()   

# veri setinde gruplar sutununda ayni olan satirlari birlestirdi 
# ve karsilik gelen degerleri topladi

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [176]:
import seaborn as sns
df = sns.load_dataset('planets')   # seabornun icinden hazir veri setini aldik.Ornek amacli.
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [178]:
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [180]:
df.tail(10)

       method  number  orbital_period  mass  distance  year
1025  Transit       1        3.067850   NaN      60.0  2012
1026  Transit       1        0.925542   NaN     470.0  2014
1027  Imaging       1             NaN   NaN      19.2  2011
1028  Transit       1        3.352057   NaN    3200.0  2012
1029  Imaging       1             NaN   NaN      10.1  2012
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [ ]:
12,23,45,56

## Dış Kaynaklı Verileri Okuma

In [ ]:
pwd

In [ ]:
import pandas as pd

In [ ]:
pd.read_csv('ornekcsv.csv', )   #data yok hata verebilir,

# on tanumli ayrac(sep) argumani virguldur.(,) ama siz bbunu sep=";" ile degistirebilirsiniz...

In [ ]:
pd.read_csv('reading_data/duz_metin.txt')  #data yok hata verebilir

In [ ]:
pd.read_excel('reading_data/ornekx.xlsx')   #data yok hata verebilir